weifengdq/embedded/tc397/tc397_tlf35584/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC39xB/IfxGtm_PinMap_TC39xB_LFBGA292_adas.c
IfxGtm_Tom_ToutMap IfxGtm_TOM2_9_TOUT52_P21_1_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_b, 52, {&MODULE_P21, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM2_9_TOUT69_P20_13_OUT = {IfxGtm_Tom_2, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_b, 69, {&MODULE_P20,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_0N_TOUT134_P22_8_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_g, 134, {&MODULE_P22, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_0N_TOUT8_P02_8_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_f, 8, {&MODULE_P02, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_0_TOUT110_P10_8_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 110, {&MODULE_P10, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_0_TOUT130_P22_4_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_f, 130, {&MODULE_P22, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_13_TOUT138_P23_6_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_b, 138, {&MODULE_P23, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_14_TOUT139_P23_7_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_b, 139, {&MODULE_P23, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_15_TOUT140_P32_5_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_b, 140, {&MODULE_P32, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_1N_TOUT135_P22_9_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_g, 135, {&MODULE_P22, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_1_TOUT131_P22_5_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_f, 131, {&MODULE_P22, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_2N_TOUT136_P22_10_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_g, 136, {&MODULE_P22,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_2_TOUT132_P22_6_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_f, 132, {&MODULE_P22, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3N_TOUT137_P22_11_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_g, 137, {&MODULE_P22,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3_TOUT133_P22_7_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_f, 133, {&MODULE_P22, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_4_TOUT110_P10_8_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_f, 110, {&MODULE_P10, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_4_TOUT134_P22_8_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_f, 134, {&MODULE_P22, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_5_TOUT135_P22_9_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_f, 135, {&MODULE_P22, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_6_TOUT136_P22_10_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_f, 136, {&MODULE_P22,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_7_TOUT137_P22_11_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_f, 137, {&MODULE_P22,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4_TOUT8_P02_8_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_e, 8, {&MODULE_P02, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_0_TOUT140_P32_5_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 140, {&MODULE_P32, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_1_TOUT141_P32_6_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_e, 141, {&MODULE_P32, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_2_TOUT142_P32_7_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_e, 142, {&MODULE_P32, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_3_TOUT138_P23_6_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_e, 138, {&MODULE_P23, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_4_TOUT139_P23_7_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_e, 139, {&MODULE_P23, 7}, IfxPort_OutputIdx_alt1};

#include "IfxGtm_bf.h"

void IfxGtm_PinMap_setTimTin(IfxGtm_Tim_TinMap *config, IfxPort_InputMode inputMode)
{
    uint32 shift = config->channel * 4;

    __ldmst_c(&(MODULE_GTM.TIMINSEL[config->tim].U), (0xFU << shift), ((uint32)config->select) << shift);

    if (inputMode != IfxPort_InputMode_undefined)
    
{        IfxPort_setPinModeInput(config->pin.port, config->pin.pinIndex, inputMode);
    }
}

void IfxGtm_PinMap_setAtomTout(IfxGtm_Atom_ToutMap *config, IfxPort_OutputMode outputMode, IfxPort_PadDriver padDriver)
{
    uint32 outselReg = (config->toutn >> 3);
    uint32 shift = (config->toutn & 0x7U) * 4;
    uint32 outsel = (uint32)config->toutSel << shift;
    uint32 mask = 0xFU << shift;
    
    __ldmst_c(&(MODULE_GTM.TOUTSEL[outselReg].U), mask, outsel);

    IfxPort_setPinModeOutput(config->pin.port, config->pin.pinIndex, outputMode, config->select);
    IfxPort_setPinPadDriver(config->pin.port, config->pin.pinIndex, padDriver);
}
void IfxGtm_PinMap_setTomTout(IfxGtm_Tom_ToutMap *config, IfxPort_OutputMode outputMode, IfxPort_PadDriver padDriver)
{
    uint32 outselReg = (config->toutn >> 3);
    uint32 shift = (config->toutn & 0x7U) * 4;
    uint32 outsel = (uint32)config->toutSel << shift;
    uint32 mask = 0xFU << shift;

    __ldmst_c(&(MODULE_GTM.TOUTSEL[outselReg].U), mask, outsel);

    IfxPort_setPinModeOutput(config->pin.port, config->pin.pinIndex, outputMode, config->select);
    IfxPort_setPinPadDriver(config->pin.port, config->pin.pinIndex, padDriver);
}
#endif

#if defined (_TASKING_) || defined (_ghs_)
#pragma restore
#endif
